Revit 2027 API
BuiltInFailures.ScheduleViewFailures.ColumnsExcluded Property
 Some columns in the project are excluded from the graphical column schedule view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnsExcluded { get; }
Public Shared ReadOnly Property ColumnsExcluded As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnsExcluded {
	FailureDefinitionId^ get ();
}
static member ColumnsExcluded : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace